___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>

In this assignment you will start off with Numpy Exercises and then complete the whole Exercise with Pandas questions. All the subjects related to questions here already covered in preclass materials and in-class sessions. So good luck!

#### 1. Import NumPy Library

In [1]:
import numpy as np

#### 2. Create an array from my_list=[5,10,15,20,25]

In [2]:
my_list=[5,10,15,20,25]
np.array(my_list)

array([ 5, 10, 15, 20, 25])

#### 3. Generate an array 5x5 zeros

In [3]:
np.zeros((5,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

#### 4. Generate an array 4x4 ones assign data type int

In [4]:
np.ones((4,4), dtype=int)

array([[1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1]])

#### 5. Make all the values of the array above 7

In [5]:
np.ones((4,4), dtype=int)*7

array([[7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7]])

#### 6. Create same array above with full method

In [6]:
np.full((4,4), 7)

array([[7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7]])

#### 7. Create an array of even integers from 2 to 16

In [7]:
np.arange(2,17,2)

array([ 2,  4,  6,  8, 10, 12, 14, 16])

#### 8. Create a 5x5 matrix with values between 0 to 25

In [8]:
np.arange(0,25).reshape((5,5))

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

#### 9. Create a 5x5 matrix with values between 0 to 25 using linspace

In [9]:
np.linspace(0,24,25, dtype=int).reshape(5,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

#### 10. Create 5 random number with numpy

In [10]:
np.random.random(5)

array([0.3279135 , 0.28293337, 0.411031  , 0.19330853, 0.11871998])

#### 11. Create random normal distributed 5x5 array

In [11]:
np.random.random(size=(5,5))

array([[0.38446182, 0.16082027, 0.45356711, 0.13255745, 0.19695303],
       [0.98223873, 0.49799629, 0.61169636, 0.42859214, 0.07720165],
       [0.58843782, 0.70297551, 0.30436774, 0.71993527, 0.94337215],
       [0.02498892, 0.9537061 , 0.0528806 , 0.55438571, 0.03267807],
       [0.09252159, 0.39496984, 0.85878681, 0.07151886, 0.98971582]])

#### 12. Create 3x4 shaped array with random int numbers between 20 and 50 with numpy

In [12]:
np.random.randint(20,50,size=(3,4))

array([[22, 36, 24, 38],
       [20, 31, 26, 45],
       [29, 29, 40, 20]])

#### 13. Reshape the array below with shape 6x8

In [13]:
ranarr = np.random.randint(0, 60, 48)
ranarr

array([41,  8,  3, 45, 36, 52, 18, 15,  5, 35, 47,  3, 41, 22, 45, 53, 32,
       23, 38, 51, 28, 45, 45, 55, 22,  0, 57,  8, 38, 31, 29, 24, 26,  5,
       40, 55, 29, 51, 39, 30, 31, 34, 37, 19, 31,  3, 41, 26])

In [14]:
ranarr.reshape(6,8)

array([[41,  8,  3, 45, 36, 52, 18, 15],
       [ 5, 35, 47,  3, 41, 22, 45, 53],
       [32, 23, 38, 51, 28, 45, 45, 55],
       [22,  0, 57,  8, 38, 31, 29, 24],
       [26,  5, 40, 55, 29, 51, 39, 30],
       [31, 34, 37, 19, 31,  3, 41, 26]])

In [15]:
#reshape with -1
ranarr.reshape(-1,8)

array([[41,  8,  3, 45, 36, 52, 18, 15],
       [ 5, 35, 47,  3, 41, 22, 45, 53],
       [32, 23, 38, 51, 28, 45, 45, 55],
       [22,  0, 57,  8, 38, 31, 29, 24],
       [26,  5, 40, 55, 29, 51, 39, 30],
       [31, 34, 37, 19, 31,  3, 41, 26]])

## Numpy Indexing and Selection

In [16]:
#Create array below
arr =np.arange(1,17).reshape(4,4)
arr

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

#### 14. Write code that reproduces the output shown below.<br>

In [17]:
arr= np.array([[6,7],[10,11]])
arr

array([[ 6,  7],
       [10, 11]])

#### 15. Get the first column of the array.

In [18]:
arr[:,0]

array([ 6, 10])

#### 16. Get the values in 2nd row for every 2 step.

In [19]:
arr[1,0::2]

array([10])

#### 17.Assign 77 to every cell in 3rd column.

In [20]:
arr= np.arange(1,17).reshape(4,4)
arr
arr[:,2:3]=77
arr

array([[ 1,  2, 77,  4],
       [ 5,  6, 77,  8],
       [ 9, 10, 77, 12],
       [13, 14, 77, 16]])

#### 18. Take 1st row 0 column, 3th row 2nd column.

In [21]:
arr[[1,3],[0,2]]

array([ 5, 77])

#### 19. Take between 2nd and last row with step 2 and between 1 and last column with step 2.

In [22]:
arr[1::2,0::2]

array([[ 5, 77],
       [13, 77]])

## NumPy Operations

#### 20. Get the sum of values smaller than 10 and values bigger than 12 from array above

In [23]:
arr[a<10]

NameError: name 'a' is not defined

In [ ]:
arr[a>12]

array([77, 77, 77, 13, 14, 77, 16])

In [ ]:
b = arr[a<10] + arr[a>12]
b

array([78, 79, 81, 18, 20, 85, 25])

#### 21. Get the standard deviation of the result above

In [ ]:
b.std()

29.700546274093877

#### 22. Get the sum of second column from array above

In [ ]:
#print array here  
arr

array([[ 1,  2, 77,  4],
       [ 5,  6, 77,  8],
       [ 9, 10, 77, 12],
       [13, 14, 77, 16]])

In [ ]:
np.sum(a[:,1:2])

32

#### 23. Get the median,mean and std of 3rd column from array above

In [ ]:
#median
c= np.arange(1,17).reshape(4,4)
c

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [ ]:
np.median(c[2,:])

10.5

In [ ]:
#mean
c[2,:].mean()

10.5

In [ ]:
#std
c[2,:].std()

1.118033988749895

# Pandas Section

In [ ]:
import pandas as pd

**Read Salaries.csv take a look at first 5 rows, df info and df statistical measurements**

In [ ]:
df = pd.read_csv("C:/Users/LENOVO/Desktop/ME/1.CLRSWY/1.DATA SCIENCE/PANDAS/Salaries.csv")

In [ ]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                5 non-null      int64
 1   EmployeeName      5 non-null      object
 2   JobTitle          5 non-null      object
 3   BasePay           5 non-null      float64
 4   OvertimePay       5 non-null      float64
 5   OtherPay          5 non-null      float64
 6   Benefits          0 non-null      float64
 7   TotalPay          5 non-null      float64
 8   TotalPayBenefits  5 non-null      float64
 9   Year              5 non-null      int64
 10  Notes             0 non-null      float64
 11  Agency            5 non-null      object
 12  Status            0 non-null      float64
dtypes: float64(8), int64(2), object(3)
memory usage: 648.0+ bytes

In [ ]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,5.000000,5.000000,5.000000,5.000000,0.0,5.000000,5.000000,5.0,0.0,0.0
mean,3.000000,149686.786000,83415.554000,186997.944000,NaN,420100.284000,420100.284000,2011.0,NaN,NaN
std,1.581139,49279.467429,99747.068306,138838.049118,NaN,122015.258729,122015.258729,0.0,NaN,NaN
min,1.000000,77916.000000,0.000000,16452.600000,NaN,326373.190000,326373.190000,2011.0,NaN,NaN
25%,2.000000,134401.600000,9737.000000,137811.380000,NaN,332343.610000,332343.610000,2011.0,NaN,NaN
50%,3.000000,155966.020000,56120.710000,182234.590000,NaN,335279.910000,335279.910000,2011.0,NaN,NaN
75%,4.000000,167411.180000,106088.180000,198306.900000,NaN,538909.280000,538909.280000,2011.0,NaN,NaN
max,5.000000,212739.130000,245131.880000,400184.250000,NaN,567595.430000,567595.430000,2011.0,NaN,NaN

**How many different year value are there**

In [ ]:
df = pd.read_csv("C:/Users/LENOVO/Desktop/ME/1.CLRSWY/1.DATA SCIENCE/PANDAS/Salaries.csv")
df
df['Year'].value_counts()

2014    38123
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

**Print out max and avg Totalpay**

In [ ]:
#max
df['TotalPay'].max()

567595.43

In [ ]:
#avg
df['TotalPay'].mean()

74768.321971703

**How many records are there which have TotalPay bigger than avg TotalPay**

In [ ]:
df = pd.read_csv("C:/Users/LENOVO/Desktop/ME/1.CLRSWY/1.DATA SCIENCE/PANDAS/Salaries.csv")
df
len(df[df['TotalPay'] > df['TotalPay'].mean()])

69489

**How much does ALBERT PARDINI make (including benefits)?**

In [ ]:
df['TotalPayBenefits'][df['EmployeeName'] == 'ALBERT PARDINI']

2    335279.91
Name: TotalPayBenefits, dtype: float64

**Who is lowest paid person**

In [ ]:
df['TotalPay'].min()

-618.13

In [ ]:
df[df['TotalPay'] == -618.13]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

**What are the unique Jobs in dataset?**

In [ ]:
df.JobTitle.unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

**List 3 least common Jobs**

In [ ]:
df['JobTitle'].value_counts().tail(3)

COURT COMPUTER FACILITIES COORDINATOR             1
AUTOMOTIVE BODY AND FENDER WORKER SUPERVISOR I    1
VICTIM & WITNESS TECHNICIAN                       1
Name: JobTitle, dtype: int64

**How many people earned more than avg in 2012**

In [ ]:
# olmadı
df['Id'][(df['TotalPayBenefits'] > df['TotalPayBenefits'].mean()) & (df['Year'] == 2012)].count()

20366

**How many people have the word Manager in their job title?**

In [ ]:
#use apply function here
x = df.apply(lambda x: x.str.contains('Manager', case=False) if x.name in ['JobTitle'] else x)['JobTitle']
x.sum()

4110

**Take Id,EmployeeName,JobTitle,TotalPay and TotalPayBenefits columns with iloc and assign it as sal_new dataframe**

In [ ]:
sal_new=df.iloc[:,[0,1,2,7,8]]
sal_new

,Id,EmployeeName,JobTitle,TotalPay,TotalPayBenefits
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43,567595.43
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),538909.28,538909.28
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91,335279.91
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61,332343.61
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19,326373.19
...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00
148650,148651,Not provided,Not provided,0.00,0.00
148651,148652,Not provided,Not provided,0.00,0.00
148652,148653,Not provided,Not provided,0.00,0.00
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13,-618.13

**Take columns betweeen EmployeeName and TotalPayBenefits with loc and assign it o sal_new df**

In [ ]:
al_new = df.loc[:, ['EmployeeName', 'JobTitle', 'TotalPay', 'TotalPayBenefits']]
sal_new

,Id,EmployeeName,JobTitle,TotalPay,TotalPayBenefits
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43,567595.43
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),538909.28,538909.28
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91,335279.91
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61,332343.61
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19,326373.19
...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00
148650,148651,Not provided,Not provided,0.00,0.00
148651,148652,Not provided,Not provided,0.00,0.00
148652,148653,Not provided,Not provided,0.00,0.00
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13,-618.13

**Print out the names of the employees who earn more than min, but less than avg**

In [ ]:
df['EmployeeName'][(df['TotalPayBenefits'] > df['TotalPayBenefits'].min()) | 
                   (df['TotalPayBenefits'] < df['TotalPayBenefits'].mean())]

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650         Not provided
148651         Not provided
148652         Not provided
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object